build/docs/css.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-11 Sun 22:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Building Interactive Experiment involving Binary Search Trees - Styles</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Ankit Pant, Danish Mukhtar, Giridhari Lal Gupta (APS Team) VLEAD" />
<link rel="stylesheet" type="text/css" href="./style/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="./style/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Building Interactive Experiment involving Binary Search Trees - Styles</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0c138bb">1. Introduction</a></li>
<li><a href="#org99f8b4f">2. Styles</a></li>
<li><a href="#org3ef3401">3. Tangle</a></li>
</ul>
</div>
</div>


<div id="outline-container-org0c138bb" class="outline-2">
<h2 id="org0c138bb"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The following code is used to enhance the presentation of the application front-end that the user interacts with.
</p>
</div>
</div>

<div id="outline-container-org99f8b4f" class="outline-2">
<h2 id="org99f8b4f"><span class="section-number-2">2</span> Styles</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-css" id="orgc3ba113">
<span style="font-weight: bold;">#heading</span>{
    <span style="font-weight: bold; font-style: italic;">border</span>: 2px solid greenyellow;
    <span style="font-weight: bold; font-style: italic;">background-color</span>: rgba(27, 27, 27, 0.938);
    <span style="font-weight: bold; font-style: italic;">text-align</span>: center;
    <span style="font-weight: bold; font-style: italic;">padding</span>:0.25%;
    <span style="font-weight: bold; font-style: italic;">box-shadow</span>: 8px 8px 8px -1px gray;
    <span style="font-weight: bold; font-style: italic;">position</span>: sticky;
    <span style="font-weight: bold; font-style: italic;">top</span>:0;
    <span style="font-weight: bold; font-style: italic;">color</span>:white
}
<span style="font-weight: bold;">#Main-heading</span>{
    <span style="font-weight: bold; font-style: italic;">text-shadow</span>: 2px 1px rgb(245, 245, 245), 3px 3px rgba(219, 65, 18, 0.856);
    <span style="font-weight: bold; font-style: italic;">font-weight</span>: bold;
    <span style="font-weight: bold; font-style: italic;">font-family</span>: cursive;
}

<span style="font-weight: bold;">.palette</span>{
    <span style="font-weight: bold; font-style: italic;">width</span>:100%;
    <span style="font-weight: bold; font-style: italic;">height</span>: fit-content;
    <span style="font-weight: bold; font-style: italic;">text-align</span>: center;
    <span style="font-weight: bold; font-style: italic;">z-index</span>: 2;
    <span style="font-weight: bold; font-style: italic;">border</span>: 2px double rgb(0, 204, 255);
    <span style="font-weight: bold; font-style: italic;">background-color</span>: rgb(31, 31, 31);
    <span style="font-weight: bold; font-style: italic;">padding</span>: 0.5%;
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">margin-left: 20%; </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">margin-top: 0.3%; </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold; font-style: italic;">box-shadow</span>: 5px 5px 5px 2px rgb(128, 128, 128);
    <span style="font-weight: bold; font-style: italic;">position</span>: fixed sticky;
    <span style="font-weight: bold; font-style: italic;">top</span>: 12.5%;
}

<span style="font-weight: bold;">.btn</span>{
    <span style="font-weight: bold; font-style: italic;">padding</span>: 5%;
    <span style="font-weight: bold; font-style: italic;">margin-left</span>: 10px <span style="font-weight: bold;">!important</span>;
    <span style="font-weight: bold; font-style: italic;">margin-bottom</span>: 5px <span style="font-weight: bold;">!important</span>;
    <span style="font-weight: bold; font-style: italic;">margin-top</span>: 5px <span style="font-weight: bold;">!important</span>;
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">margin-left: 5%; </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">box-shadow: 2px 1px 2px 2px; </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold; font-style: italic;">font-weight</span>: bold;

}

<span style="font-weight: bold;">.tree-container</span>{
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">border: 2px solid rgb(255, 0, 255); </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold; font-style: italic;">margin-top</span>: 2%;
    <span style="font-weight: bold; font-style: italic;">margin-left</span>: 18%;
    <span style="font-weight: bold; font-style: italic;">height</span>: 65%;
    <span style="font-weight: bold; font-style: italic;">width</span>: 70%;
    <span style="font-weight: bold; font-style: italic;">overflow</span>: auto;
    <span style="font-weight: bold; font-style: italic;">text-align</span>: center;
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">align-content: center; </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">align-items: center; </span><span style="font-weight: bold; font-style: italic;">*/</span>
     
}

<span style="font-weight: bold;">.statusbar</span>{
    <span style="font-weight: bold; font-style: italic;">border</span>: 2px solid greenyellow;
    <span style="font-weight: bold; font-style: italic;">height</span>:10%;
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">position: fixed;</span>
<span style="font-weight: bold; font-style: italic;">    bottom:0%; </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold; font-style: italic;">width</span>:100%;
    <span style="font-weight: bold; font-style: italic;">overflow-y</span>: auto;
    <span style="font-weight: bold; font-style: italic;">margin-top</span>:10px;
    <span style="font-weight: bold; font-style: italic;">padding-left</span>: 5%;
    
}

</pre>
</div>
</div>
</div>
<div id="outline-container-org3ef3401" class="outline-2">
<h2 id="org3ef3401"><span class="section-number-2">3</span> Tangle</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-css">&lt;&lt;main&gt;&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ankit Pant, Danish Mukhtar, Giridhari Lal Gupta (APS Team) VLEAD</p>
<p class="date">Created: 2018-11-11 Sun 22:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
